tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# CLI tools
brew "fish" 
brew "bat" 
brew "grc"
brew "git-delta" 
brew "dog" 
brew "exa" 
brew "fd" 
brew "fzf" 
brew "gh" 
brew "ripgrep" 
brew "starship" 
brew "zoxide"
brew "micro"

# Programming
brew "git-lfs"
brew "node"
brew "yarn"
brew "postgresql"

# CLI tools
brew "youtube-dl"
brew "mas"

# QuickLook
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"

# fonts
cask "font-inter"
cask "font-inconsolata-nerd-font"

# GUI apps
cask "1password"
cask "discord"
cask "iterm2"
cask "microsoft-edge"
cask "mos"
cask "notion"
cask "spotify"
cask "visual-studio-code"
cask "figma"
cask "gitkraken"
cask "radio-silence"
cask "appcleaner"
cask "keep-it"
cask "raindropio"
cask "rectangle"
cask "linear-linear"
cask "zoom"
cask "microsoft-teams"
cask "signal"
cask "whatsapp"
cask "raycast"


# App Store apps
mas "Xcode", id: 497799835
mas "Amphetamine", id: 937984704
mas "Hidden Bar", id: 1452453066
mas "Spark", id: 1176895641
mas "DaftCloud for SoundCloud", id: 1320450034